In [1]:
import pandas as pd

In [6]:
s = pd.Series([1, 2, 3, 4])
print(s)
type(s)

0    1
1    2
2    3
3    4
dtype: int64

pandas.Series

In [7]:
s1 = pd.Series([1, 2, 3, 4], index = ['A', 'B', 'C', 'D'])
print(s1)

A    1
B    2
C    3
D    4
dtype: int64

In [9]:
data = [[1, 444, 'abc'],
        [2, 555, 'def'],
        [3, 666, 'ghi'],
        [4, 444, 'xyz']
        ]
df = pd.DataFrame(data)
df

   0    1    2
0  1  444  abc
1  2  555  def
2  3  666  ghi
3  4  444  xyz

In [13]:
df1 = pd.DataFrame(data, columns=['ID','std_id', 'Dept'])
df1

   ID  std_id Dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     444  xyz

In [14]:
data_1 = {'ID':[1, 2, 3, 4],
          'std_id_dect':[444, 555, 666, 444],
          'dept':['abc', 'def', 'ghi', 'xyz']}
df_2= pd.DataFrame(data_1)
df_2

   ID  std_id_dect dept
0   1          444  abc
1   2          555  def
2   3          666  ghi
3   4          444  xyz

In [16]:
display(df_2)

   ID  std_id_dect dept
0   1          444  abc
1   2          555  def
2   3          666  ghi
3   4          444  xyz

In [41]:
df1 = pd.DataFrame(data, columns=['ID','std_id', 'Dept'])
df1

   ID  std_id Dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     444  xyz

In [20]:
df1.columns

Index(['ID', 'std_id', 'Dept'], dtype='str')

In [ ]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
index = ['row1', 'row2', 'row3','row4']
df1.index = index
display(df1)

      ID  std_id Dept
row1   1     444  abc
row2   2     555  def
row3   3     666  ghi
row4   4     444  xyz

In [25]:
# periority of type
# object ,s , f, i, b

In [27]:
df1.dtypes

ID        int64
std_id    int64
Dept        str
dtype: object

In [42]:
df1['ID'].dtype

dtype('int64')

In [45]:
df1['ID'] = df1['ID'].astype('category')

In [38]:
df1.dtypes

ID        category
std_id       int64
Dept           str
dtype: object

In [33]:
df1.tail(2)

      ID  std_id Dept
row3   3     666  ghi
row4   4     444  xyz

In [ ]:
df1.describe() # for numerical

             ID      std_id
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [46]:
df1.describe(include='category')

        ID
count    4
unique   4
top      1
freq     1

In [49]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [53]:
x= df1['std_id'].unique()
print(x)
type(x)

[444 555 666]

numpy.ndarray

In [54]:
x= df1['std_id'].unique().sum()
print(x)
type(x)

1665

numpy.int64

In [56]:
df1['std_id'].max()

np.int64(666)

In [58]:
df1.std_id.idxmax()

2

In [59]:
df1.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4 non-null      category
 1   std_id  4 non-null      int64
 2   Dept    4 non-null      str
dtypes: category(1), int64(1), str(1)
memory usage: 232.0 bytes

In [60]:
df1['Dept'].value_counts()

Dept
abc    1
def    1
ghi    1
xyz    1
Name: count, dtype: int64

In [62]:
df1['std_id'].sum()

np.int64(2109)

In [64]:
def duplicate(x):
    return x*2
df1['std_id'].apply(duplicate)
df1['std_id'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: std_id, dtype: int64

In [68]:
df1['Dept'].iloc[2]

'ghi'

In [70]:
df1.iloc[2, 1]

np.int64(666)

In [72]:
df1.Dept.iloc[0:2]

0    abc
1    def
Name: Dept, dtype: str

In [75]:
df1.iloc[:,0:2]

  ID  std_id
0  1     444
1  2     555
2  3     666
3  4     444

In [77]:
new_col= df1.std_id + df1.ID.astype(int)
new_col

0    445
1    557
2    669
3    448
dtype: int64

In [80]:
df1['new_col'] = df1['std_id'] + df1.ID.astype(int)
df1

  ID  std_id Dept  new_col
0  1     444  abc      445
1  2     555  def      557
2  3     666  ghi      669
3  4     444  xyz      448

In [81]:
df1.drop(columns=['new_col'])

  ID  std_id Dept
0  1     444  abc
1  2     555  def
2  3     666  ghi
3  4     444  xyz

In [82]:
df1.drop(0, axis=0)

  ID  std_id Dept  new_col
1  2     555  def      557
2  3     666  ghi      669
3  4     444  xyz      448

In [83]:
df1.drop([1, 2], axis=0)

  ID  std_id Dept  new_col
0  1     444  abc      445
3  4     444  xyz      448

In [87]:
df1.isnull()

      ID  std_id   Dept  new_col
0  False   False  False    False
1  False   False  False    False
2  False   False  False    False
3  False   False  False    False

In [88]:
df1.isnull().sum()

ID         0
std_id     0
Dept       0
new_col    0
dtype: int64

In [89]:
import numpy as np

In [93]:
data = [[1, 444, 'abc'],
        [2, 555, 'def'],
        [3, 666, 'ghi'],
        [4, np.nan, 'xyz']
        ]
df2= pd.DataFrame(data)
df2

   0      1    2
0  1  444.0  abc
1  2  555.0  def
2  3  666.0  ghi
3  4    NaN  xyz

In [95]:
null = df2.isnull().sum()
pd.DataFrame(null)
pd.DataFrame(null).T

   0  1  2
0  0  1  0